InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранения</Name>
					<Comment>Срок хранения (дней)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартинкаНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗадаетсяНаХарактеристику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ингредиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьХарактеристикиНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорииТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ШтрихкодыНоменклатуры/Ext/ManagerModule.bsl
// Функция осуществляет формирование нового внутреннего штрих-кода для
// штучного товара
//
// Возвращаемое значение:
//  Строка – сформированный штрих-код
//
Функция СформироватьШтучныйШтрихКодEAN13() Экспорт
	
	Запрос = Новый Запрос;
	
	ПрефиксШтучногоТовара = Формат(Справочники.ФорматыШтрихКодов.Штучный.Префикс, "ЧЦ=2; ЧН=; ЧВН=");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 3, 10)) КАК Код
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод ПОДОБНО """ + ПрефиксШтучногоТовара + "[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]""" + "
	|	И ШтрихкодыНоменклатуры.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.EAN13)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ТекКод = ?(Выборка.Код = NULL, 1, Мин(Число(Выборка.Код) + 1, 9999999999));

	а = 0;
	Штрихкод1 = ПрефиксШтучногоТовара + Формат(ТекКод, "ЧЦ=10; ЧВН=; ЧГ=");
	Штрихкод1 = Штрихкод1 + ШтрихкодированиеКлиентСервер.КонтрольныйСимволEAN(Штрихкод1, 13);

	Возврат Штрихкод1;

КонецФункции // СформироватьШтрихКод()

// Формирует штрих-коды для указанного параметра
//
// Параметры
//  Параметр  - СправочникСсылка.Номенклатура
//              СправочникСсылка.ХарактеристикиНоменклатуры 
//              СправочникСсылка.ЕдиницыИзмерения 
//
// Возвращаемое значение:
//   Число   - Количество созданных штрих-кодов
//
Функция СформироватьШтучныеШтрихкодыEAN13(Номенклатура, МассивХарактеристик = Неопределено) Экспорт

	Результат = 0;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО СпрНоменклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	|			И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО СпрНоменклатура.Ссылка = ШтрихкодыНоменклатуры.Номенклатура
	|			И (ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры)
	|			И (НЕ ШтрихкодыНоменклатуры.НеИспользуется)
	|			И (ШтрихкодыНоменклатуры.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Ссылка
	|	И ШтрихкодыНоменклатуры.Штрихкод ЕСТЬ NULL 
	|	И ((НЕ СпрНоменклатура.ИспользоватьХарактеристикиНоменклатуры)
	|			ИЛИ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ НЕ NULL )
	|ИТОГИ ПО
	|	ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 3, 10)), ""0"") КАК Код
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод ПОДОБНО ""%Префикс%[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]""
	|	И ШтрихкодыНоменклатуры.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.EAN13)";
	
	Если МассивХарактеристик <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ ХарактеристикиНоменклатуры.ПометкаУдаления", "ХарактеристикиНоменклатуры.Ссылка В (&МассивХарактеристик)");
	КонецЕсли;
	
	ПрефиксШтучногоТовара = Формат(Справочники.ФорматыШтрихКодов.Штучный.Префикс, "ЧЦ=2; ЧН=; ЧВН=");
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%Префикс%", ПрефиксШтучногоТовара);
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Запрос.УстановитьПараметр("МассивХарактеристик", МассивХарактеристик);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ПоследнийКод = 0;
	
	ВыборкаКода = МассивРезультатов[1].Выбрать();
	Если ВыборкаКода.Следующий() Тогда
		ПоследнийКод = Число(ВыборкаКода.Код);
	КонецЕсли;
	
	НаборЗаписейШК = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
	
	НаборЗаписейШК.Отбор.Номенклатура.Установить(Номенклатура);
	
	ВыборкаПоЕдиницамИзмерения = МассивРезультатов[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоЕдиницамИзмерения.Следующий() Цикл
		
		НаборЗаписейШК.Отбор.ЕдиницаИзмерения.Установить(ВыборкаПоЕдиницамИзмерения.ЕдиницаИзмерения);
		
		Выборка = ВыборкаПоЕдиницамИзмерения.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ПоследнийКод = 99999999 Тогда
				Возврат -1;
			Иначе
				ПоследнийКод = ПоследнийКод + 1;
			КонецЕсли;
			
			Штрихкод = ПрефиксШтучногоТовара + Формат(ПоследнийКод, "ЧЦ=10; ЧВН=; ЧГ=");
			Штрихкод = Штрихкод + ШтрихкодированиеКлиентСервер.КонтрольныйСимволEAN(ШтрихКод, 13);
			
			НаборЗаписейШК.Отбор.ХарактеристикаНоменклатуры.Установить(Выборка.Характеристика);
			НаборЗаписейШК.Отбор.Штрихкод.Установить(Штрихкод);
			
			НоваяЗапись = НаборЗаписейШК.Добавить();
			
			НоваяЗапись.Номенклатура = Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = Выборка.Характеристика;
			НоваяЗапись.ЕдиницаИзмерения = ВыборкаПоЕдиницамИзмерения.ЕдиницаИзмерения;
			НоваяЗапись.Штрихкод = Штрихкод;
			
			НоваяЗапись.ТипШтрихкода = Перечисления.ТипыШтрихкодов.EAN13;
			НоваяЗапись.НеИспользуется = Ложь;
			
			Результат = Результат + 1;
			
			НаборЗаписейШК.Записать();
			
			НаборЗаписейШК.Очистить();
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СформироватьШтучныеШтрихкодыEAN13()

// Функция возвращает данные по найденному штрих-коду
//
// Параметры:
//  ШтрихКод - штрих-код для поиска;
//
// Возвращаемое значение:
//  ТаблицаЗначений - Найденные данные штрих-кода.
//
Функция ПолучитьДанныеНоменклатурыПоШтрихкоду(Штрихкод) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(ШтрихКод);
	
	Возврат ПолучитьДанныеНоменклатурыПоШтрихкодам(Массив);
	
КонецФункции

// Функция получает данные штрих-кодов из регистров
//
// Параметры:
//  Штрихкоды - Массив - штрих-коды для поиска
//
// Возвращаемое значение:
//  ТаблицаЗначений - найденные данные.
//
Функция ПолучитьДанныеНоменклатурыПоШтрихкодам(Штрихкоды) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ШтрихкодыНоменклатуры.Номенклатура.ИспользоватьХарактеристикиНоменклатуры КАК ХарактеристикиИспользуются
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод В(&МассивШтрихкодов)
	|	И НЕ ШтрихкодыНоменклатуры.НеИспользуется";

	Запрос.УстановитьПараметр("МассивШтрихкодов", Штрихкоды);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Функция осуществляет проверку уникальности штрих-кода штучного товара
//
// Параметры
//  ШтрихКод          - Строка - проверяемый штрих-код.
//  Номенклатура      - СправочникСсылка.Номенклатура  - номенклатура записываемого ШК
//  Характеристика    - СправочникСсылка.ХарактеристикиНоменклатуры  - характеристика записываемого ШК
//  ЕдиницаИзмерения  - СправочникСсылка.ЕдиницыИзмерения  - ед.изм. номенклатуры записываемого ШК
//
// Возвращаемое значение:
//  Структура - результат поиска (Используется), с заполненными полями для вывода сообщения,
//              если поиск удался
//
Функция ПроверитьУникальностьШтрихкода(Штрихкод, Номенклатура, Характеристика, ЕдиницаИзмерения) Экспорт

	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", Штрихкод);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Характеристика);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);

	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыНоменклатуры.Номенклатура.Наименование КАК НаименованиеНоменклатуры,
	|	ШтрихкодыНоменклатуры.Номенклатура.Код КАК Код,
	|	ШтрихкодыНоменклатуры.Номенклатура.Артикул КАК Артикул,
	|	ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры.Наименование КАК НаименованиеХарактеристики
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &ШтрихКод
	|	И (НЕ(ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|				И ШтрихкодыНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|				И ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры))
	|	И (НЕ ШтрихкодыНоменклатуры.НеИспользуется)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат.Вставить("Используется", Выборка.Следующий());
	Если Результат.Используется Тогда
		Результат.Вставить("Номенклатура"              , Выборка.Номенклатура);
		Результат.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
		Результат.Вставить("НаименованиеНоменклатуры"  , Выборка.НаименованиеНоменклатуры);
		Результат.Вставить("Код"                       , Выборка.Код);
		Результат.Вставить("Артикул"                   , Выборка.Артикул);
		Результат.Вставить("НаименованиеХарактеристики", Выборка.НаименованиеХарактеристики);
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПроверитьУникальностьШтрихКода()

// Функция осуществляет поиск штрих-кода по номенклатуре, характеристике, единице измерения и заданному типу.
// 
// Параметры
//  Номенклатура      - СправочникСсылка.Номенклатура  - номенклатура записываемого ШК
//  Характеристика    - СправочникСсылка.ХарактеристикиНоменклатуры  - характеристика записываемого ШК
//  ЕдиницаИзмерения  - СправочникСсылка.ЕдиницыИзмерения  - ед.изм. номенклатуры записываемого ШК
//  ТипШтрихКода      - ПеречислениеСсылка.ТипыШтрихкодов - тип записываемого штрих-код.
//
// Возвращаемое значение:
//  СписокШтрихКодов  - СписокЗначений -  результат поиска (Используется)
Функция ПолучитьШтрихКодПоНоменклатуре(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ТипШтрихКода = Неопределено) Экспорт 	
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
				   |	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихКод
				   |ИЗ
				   |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
				   |ГДЕ
				   |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
				   |	И ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры 	               
				   |	И (НЕ ШтрихкодыНоменклатуры.НеИспользуется)
				   |	И (ШтрихкодыНоменклатуры.ТипШтрихкода = &ТипШтрихКода ИЛИ &ТипШКНеЗадан) 
				   |	И ШтрихкодыНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	
	
	Запрос.УстановитьПараметр("Номенклатура", 				Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", 			ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ТипШтрихКода", 				ТипШтрихКода);
	Запрос.УстановитьПараметр("ТипШКНеЗадан", 		   		НЕ ЗначениеЗаполнено(ТипШтрихКода));
	
	Выборка = Запрос.Выполнить().Выбрать();
	СписокШтрихКодов = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокШтрихКодов.Добавить(Выборка.ШтрихКод); 
	КонецЦикла;	
	Возврат СписокШтрихКодов;
КонецФункции	
 
// Функция осуществляет поиск штрих-кода по номенклатуре, характеристике, и заданному типу.
// Выбирает первый из списка.
//
// Параметры
//  МенеджерВТ     	  - МенеджерВременныхТаблиц  
//  ТипШтрихКода      - ПеречислениеСсылка.ТипыШтрихкодов - тип записываемого штрих-код.
//  !!! (Обязательные колонки во  ВТ "ТаблицаТоваровСШаблонамиБезШК"- Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения)
//  ТолькоВнутреннийШК - Булево - если Ложь, то сначала получаем внутренний ШК, если его нет, то ищется внешний ШК
//
// Возвращаемое значение:
//  ВТ "ТаблицаТоваров" - ВТ с дополнительной колонкой "ШтрихКод"
Процедура  ДополнитьЗапросШтрихКодом(МенеджерВт, ТипШтрихКода = Неопределено, ТолькоВнутреннийШК = Ложь) Экспорт 	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВт;
	Запрос.УстановитьПараметр("ТипШтрихКода", 		ТипШтрихКода);
	Запрос.УстановитьПараметр("ТипШКНеЗадан", 		Не ЗначениеЗаполнено(ТипШтрихКода));
	Запрос.УстановитьПараметр("ТолькоВнутреннийШК", ТолькоВнутреннийШК);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваровБезШК.Номенклатура,
	|	ТаблицаТоваровБезШК.ХарактеристикаНоменклатуры,
	|	ТаблицаТоваровБезШК.ЕдиницаИзмерения,
	|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод
	|ПОМЕСТИТЬ ТаблицаТоваровСВнутреннимШК
	|ИЗ
	|	ТаблицаТоваровСШаблонамиБезШК КАК ТаблицаТоваровБезШК
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ТаблицаТоваровБезШК.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И ТаблицаТоваровБезШК.ХарактеристикаНоменклатуры = ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры
	|			И ТаблицаТоваровБезШК.ЕдиницаИзмерения = ШтрихкодыНоменклатуры.ЕдиницаИзмерения
	|			И (&ТипШтрихкода = ШтрихкодыНоменклатуры.ТипШтрихкода
	|				ИЛИ &ТипШКНеЗадан)
	|			И (НЕ ШтрихкодыНоменклатуры.НеИспользуется)
	|			И (ШтрихкодыНоменклатуры.Штрихкод ПОДОБНО ""2%"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваровБезШК.Номенклатура,
	|	ТаблицаТоваровБезШК.ХарактеристикаНоменклатуры,
	|	ТаблицаТоваровБезШК.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровСВнутреннимШК.Номенклатура,
	|	ТаблицаТоваровСВнутреннимШК.ХарактеристикаНоменклатуры,
	|	ТаблицаТоваровСВнутреннимШК.ЕдиницаИзмерения,
	|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод
	|ПОМЕСТИТЬ ТаблицаТоваровСВнешнимШК
	|ИЗ
	|	ТаблицаТоваровСВнутреннимШК КАК ТаблицаТоваровСВнутреннимШК
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ТаблицаТоваровСВнутреннимШК.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И ТаблицаТоваровСВнутреннимШК.ХарактеристикаНоменклатуры = ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры
	|			И ТаблицаТоваровСВнутреннимШК.ЕдиницаИзмерения = ШтрихкодыНоменклатуры.ЕдиницаИзмерения
	|			И (&ТипШтрихкода = ШтрихкодыНоменклатуры.ТипШтрихкода
	|				ИЛИ &ТипШКНеЗадан)
	|			И (НЕ ШтрихкодыНоменклатуры.НеИспользуется)
	|			И (НЕ ШтрихкодыНоменклатуры.Штрихкод ПОДОБНО ""2%"")
	|			И (ТаблицаТоваровСВнутреннимШК.Штрихкод ЕСТЬ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваровСВнутреннимШК.Номенклатура,
	|	ТаблицаТоваровСВнутреннимШК.ХарактеристикаНоменклатуры,
	|	ТаблицаТоваровСВнутреннимШК.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА &ТолькоВнутреннийШК ТОГДА ЕСТЬNULL(ТаблицаТоваровСВнутреннимШК.Штрихкод, """") 
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровСВнутреннимШК.Штрихкод, ЕСТЬNULL(ТаблицаТоваровСВнешнимШК.Штрихкод, """")) КОНЕЦ КАК Штрихкод,
	|	ВЫБОР КОГДА ТаблицаТоваровСВнешнимШК.Штрихкод ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ВнешнийШК, 
	|	ТаблицаТоваровБезШК.*
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваровСШаблонамиБезШК КАК ТаблицаТоваровБезШК
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваровСВнутреннимШК КАК ТаблицаТоваровСВнутреннимШК
	|		ПО ТаблицаТоваровБезШК.Номенклатура = ТаблицаТоваровСВнутреннимШК.Номенклатура
	|			И ТаблицаТоваровБезШК.ХарактеристикаНоменклатуры = ТаблицаТоваровСВнутреннимШК.ХарактеристикаНоменклатуры
	|			И ТаблицаТоваровБезШК.ЕдиницаИзмерения = ТаблицаТоваровСВнутреннимШК.ЕдиницаИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваровСВнешнимШК КАК ТаблицаТоваровСВнешнимШК
	|		ПО ТаблицаТоваровБезШК.Номенклатура = ТаблицаТоваровСВнешнимШК.Номенклатура
	|			И ТаблицаТоваровБезШК.ХарактеристикаНоменклатуры = ТаблицаТоваровСВнешнимШК.ХарактеристикаНоменклатуры
	|			И ТаблицаТоваровБезШК.ЕдиницаИзмерения = ТаблицаТоваровСВнешнимШК.ЕдиницаИзмерения";
		
		
	Запрос.Выполнить();
	
	//ОбщегоНазначенияДУМ.ПолучитьДанныеВременнойТаблицы(МенеджерВт, "ТаблицаТоваровСВнешнимШК");
	//ОбщегоНазначенияДУМ.ПолучитьДанныеВременнойТаблицы(МенеджерВт, "ТаблицаТоваровСВнутреннимШК");
	//ОбщегоНазначенияДУМ.ПолучитьДанныеВременнойТаблицы(МенеджерВт, "ТаблицаТоваров");
КонецПроцедуры
